ХМНПФ_Общее/DataProcessors/уп_ПереходВДругойПФОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПереходВДругойПФОПС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговораОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияДоговоровОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПричиныЗакрытияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПричиныЗакрытияДоговоровОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПричиныЗакрытияДоговораОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_ТекущаяСуммаГарантирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТекущаяСуммаГарантирования</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_РезервыОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РезервыОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Движение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДвиженияЕПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.епс_ВидыДвиженияПенсионныхНакоплений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_НачисленияПенсийОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_НачисленияПенсийОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодичностьВыплат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПериодичностьВыплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПенсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыПенсийОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыРезервовОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыРезервовОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервПенсионныйНакоплений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервСрочнойВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выплатной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервЕВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийЕВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийРасторжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийВозвратМСКРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийВозвратМСКРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНаследниковРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНаследниковРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийРазделениеСНИЛС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговоровОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПодтвержденияПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПоступленияВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриостановленПоОтказуИзПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбязательстваВыполнены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Анулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыПенсийОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыПенсийОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Срочная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пожизненная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_РешениеОбОтказеСВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РешениеОбОтказеСВ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_ПереходВДругойПФОПС/Ext/ObjectModule.bsl
// ХМНПФ 20.03.2017 ШадринАВ // Новая ХМ_ОткорректироватьИД() // №865
Процедура ХМ_ОткорректироватьИД(СписокДокументов)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГОД(ИнвестДоходОПС.Период) КАК ГодИД,
		|	ИнвестДоходОПС.ДоговорОПС КАК ДоговорОПС,
		|	ИнвестДоходОПС.ТипСуммы,
		|	ИнвестДоходОПС.СуммаОборот КАК Сумма
		|ИЗ
		|	РегистрНакопления.уп_ИнвестДоходОПС.Обороты(
		|			,
		|			,
		|			Год,
		|			ДоговорОПС В (&СписокДоговоров)
		|				И ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)) КАК ИнвестДоходОПС
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоговорОПС,
		|	ГодИД";
	
	Для Каждого Док Из СписокДокументов Цикл
		ДокОбъект = Док.ПолучитьОбъект();
		СписокДоговоров = ДокОбъект.ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС");
		Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
		ТЗИнвДоход = Запрос.Выполнить().Выгрузить();
		ГодФД = Год(ДатаФормированияДокументов);
		Для Каждого стр Из ДокОбъект.ДоговорыОПС Цикл
			ГодВступВСилу = Год(стр.ДатаВступленияВДействие);
			Если ГодВступВСилу > ГодФД - 5 Тогда // 5 лет еще не прошло
				// Отнимается весь ИД начисленный в фонде
				ИДДоговора = ТЗИнвДоход.Скопировать(Новый Структура("ДоговорОПС",стр.ДоговорОПС));
			ИначеЕсли ГодВступВСилу < ГодФД - 5 Тогда // прошло больше 5 лет
				Если ГодВступВСилу = 2012 Тогда
					// Отнимается ИД начисленный в фонде за 2017 год
					ИДДоговора = ТЗИнвДоход.Скопировать(Новый Структура("ГодИД,ДоговорОПС",2017,стр.ДоговорОПС));  // 2017
				ИначеЕсли ГодВступВСилу < 2012 Тогда
					// Отнимается ИД начисленный в фонде за 2016 и 2017 годы
					ИДДоговора = ТЗИнвДоход.Скопировать(Новый Структура("ГодИД,ДоговорОПС",2016,стр.ДоговорОПС));  // 2016
					ИДДоговора2017 = ТЗИнвДоход.Скопировать(Новый Структура("ГодИД,ДоговорОПС",2017,стр.ДоговорОПС));  // 2017
					// нужнор объединить ТЗ с ИД в одну
					Для Каждого стрИД2017 Из ИДДоговора2017 Цикл
						стрОбщИД = ИДДоговора.Добавить();
						ЗаполнитьЗначенияСвойств(стрОбщИД,стрИД2017);
					КонецЦикла;
				КонецЕсли;
			Иначе // прошло 5 лет
				// отдать весь остаток на счете
				Продолжить;
			КонецЕсли;
			// ??? Сравнивается с зафиксированными обязательствами, отдается большая сумма: Макс(фикс. обязательства, остаток после отнятия ИД)
			стр.Сумма = стр.Сумма - ИДДоговора.Итог("Сумма"); //Макс(стр.СуммаГарантированная, стр.Сумма - ИДДоговора.Итог("Сумма"));
			// еще расшифровка
			ИДДоговора.Свернуть("ДоговорОПС,ТипСуммы","Сумма");
			Для Каждого стрИД Из ИДДоговора Цикл
				МСтрок = ДокОбъект.РасшифровкаСуммы.НайтиСтроки(Новый Структура("ДоговорОПС,ТипСуммы,ТипРезерва",стрИД.ДоговорОПС,стрИД.ТипСуммы,Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений));
				Если МСтрок.Количество()>0 Тогда
					МСтрок[0].Сумма = МСтрок[0].Сумма - стрИД.Сумма; //Макс(МСтрок[0].СуммаГарантированная, МСтрок[0].Сумма - стрИД.Сумма);
				Иначе
					Сообщить("В расшифровке не найден договор "+стрИД.ДоговорОПС+" с типом суммы "+стрИД.ТипСуммы+". Документ "+ДокОбъект.Ссылка);
				КонецЕсли;
			КонецЦикла;
			Если НЕ стр.Сумма = ДокОбъект.РасшифровкаСуммы.Выгрузить(Новый Структура("ДоговорОПС",стр.ДоговорОПС)).Итог("Сумма") Тогда
				Сообщить("По договору "+стр.ДоговорОПС+" сумма в ТЧ.ДоговорыОПС не равна сумме в ТЧ.РасшифровкаСуммы. Документ "+ДокОбъект.Ссылка);
			КонецЕсли;
			ИДДоговора=Неопределено;
			МСтрок=Неопределено;
		КонецЦикла;
		ДокОбъект.Записать();
		ДокОбъект=Неопределено;
		ТЗИнвДоход=Неопределено;
	КонецЦикла;

КонецПроцедуры // ХМ_ОткорректироватьИД

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 20.03.2017 ШадринАВ // РазобратьОбщуюТаблицу() // №865
	// ХМНПФ 20.03.2017 ШадринАВ // РассчитатьДокументы() // №865
	// ХМНПФ 20.03.2017 ШадринАВ // Новая ХМ_ОткорректироватьИД() // №865
КонецПроцедуры


&ИзменениеИКонтроль("РазобратьОбщуюТаблицу")
Процедура ХМРазобратьОбщуюТаблицу(ТабЗн, Протокол, ПротоколЗаявления, ИмяФайла)

	Запрос = Новый Запрос;
	//bardoshina+
	ПерваяЗаписьВПротоколеЗаявлений = Истина;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Если НЕ ИсключатьЗаявленияЕВНПСПВ Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабДляЗагрузки.СНИЛС,
		|	ТабДляЗагрузки.Фамилия,
		|	ТабДляЗагрузки.Имя,
		|	ТабДляЗагрузки.Отчество,
		|	ТабДляЗагрузки.Нпп,
		|	ТабДляЗагрузки.НовыйСтраховщик,
		|	ТабДляЗагрузки.НовыйСтраховщикИНН,
		|	ТабДляЗагрузки.ТипПерехода,
		|	ТабДляЗагрузки.НовыйСтраховщикНаименование
		|ПОМЕСТИТЬ ИсходныеДанные
		|ИЗ
		|	&ТабДляЗагрузки КАК ТабДляЗагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ДоговорыОПС.Ссылка КАК ДоговорОПС,
		|	ИсходныеДанные.СНИЛС,
		|	ИсходныеДанные.Фамилия,
		|	ИсходныеДанные.Имя,
		|	ИсходныеДанные.Отчество,
		|	ИсходныеДанные.Нпп,
		|	ИсходныеДанные.НовыйСтраховщик,
		|	ИсходныеДанные.НовыйСтраховщикИНН,
		|	ИсходныеДанные.ТипПерехода,
		|	ИсходныеДанные.НовыйСтраховщикНаименование
		|ПОМЕСТИТЬ ДоговорыОПС
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уп_ДоговорыОПС КАК уп_ДоговорыОПС
		|		ПО ИсходныеДанные.СНИЛС = уп_ДоговорыОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыОПС.СНИЛС КАК СНИЛС,
		|	ДоговорыОПС.Фамилия,
		|	ДоговорыОПС.Имя,
		|	ДоговорыОПС.Отчество,
		|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
		|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник КАК ЗЛ,
		|	уп_СостоянияДоговораОПССрезПоследних.Состояние,
		|	ДоговорыОПС.Нпп КАК Нпп,
		|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Код КАК ДоговорНомер,
		|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.ДатаЗаключения КАК ДоговорДата,
		|	ДоговорыОПС.НовыйСтраховщик,
		|	ДоговорыОПС.НовыйСтраховщикИНН КАК НовыйСтраховщикИНН,
		|	ДоговорыОПС.НовыйСтраховщикНаименование,
		|	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия,
		|	ДоговорыОПС.ТипПерехода,
		|	ВЫБОР
		|		КОГДА уп_СостоянияДоговораОПССрезПоследних.Состояние = &НакопительныйПериод
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВесСостояния
		|ИЗ
		|	ДоговорыОПС КАК ДоговорыОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(
		|				&ДатаДок,
		|				ДоговорОПС.Организация = &Организация
		|					И ДоговорОПС В
		|						(ВЫБРАТЬ
		|							ДоговорыОПС.ДоговорОПС
		|						ИЗ
		|							ДоговорыОПС КАК ДоговорыОПС)) КАК уп_СостоянияДоговораОПССрезПоследних
		|		ПО ДоговорыОПС.ДоговорОПС = уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(
		|				&ДатаДок,
		|				ДоговорОПС.Организация = &Организация
		|					И ДоговорОПС В
		|						(ВЫБРАТЬ
		|							ДоговорыОПС.ДоговорОПС
		|						ИЗ
		|							ДоговорыОПС КАК ДоговорыОПС)) КАК уп_ПричиныЗакрытияДоговоровОПССрезПоследних
		|		ПО ДоговорыОПС.ДоговорОПС = уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ДоговорОПС
		|
		|УПОРЯДОЧИТЬ ПО
		|	Нпп,
		|	ДоговорДата УБЫВ
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДоговорОПС),
		|	СУММА(ВесСостояния)
		|ПО
		|	СНИЛС";

	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабДляЗагрузки.СНИЛС,
		|	ТабДляЗагрузки.Фамилия,
		|	ТабДляЗагрузки.Имя,
		|	ТабДляЗагрузки.Отчество,
		|	ТабДляЗагрузки.Нпп,
		|	ТабДляЗагрузки.НовыйСтраховщик,
		|	ТабДляЗагрузки.НовыйСтраховщикИНН,
		|	ТабДляЗагрузки.ТипПерехода,
		|	ТабДляЗагрузки.НовыйСтраховщикНаименование
		|ПОМЕСТИТЬ ИсходныеДанные
		|ИЗ
		|	&ТабДляЗагрузки КАК ТабДляЗагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ДоговорыОПС.Ссылка КАК ДоговорОПС,
		|	ИсходныеДанные.СНИЛС,
		|	ИсходныеДанные.Фамилия,
		|	ИсходныеДанные.Имя,
		|	ИсходныеДанные.Отчество,
		|	ИсходныеДанные.Нпп,
		|	ИсходныеДанные.НовыйСтраховщик,
		|	ИсходныеДанные.НовыйСтраховщикИНН,
		|	ИсходныеДанные.ТипПерехода,
		|	ИсходныеДанные.НовыйСтраховщикНаименование
		|ПОМЕСТИТЬ ДоговорыОПС
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уп_ДоговорыОПС КАК уп_ДоговорыОПС
		|		ПО ИсходныеДанные.СНИЛС = уп_ДоговорыОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ДоговорОПС КАК ДоговорОПС,
		|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Ссылка КАК Заявление
		|ПОМЕСТИТЬ Заявления
		|ИЗ
		|	Документ.уп_ЗаявлениеЗЛОЕдиновременнойВыплате КАК уп_ЗаявлениеЗЛОЕдиновременнойВыплате
		|ГДЕ
		|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				ДоговорыОПС.ДоговорОПС
		|			ИЗ
		|				ДоговорыОПС КАК ДоговорыОПС)
		|	И уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уп_ЗаявлениеЗЛОНазначенииНЧТП.ДоговорОПС,
		|	уп_ЗаявлениеЗЛОНазначенииНЧТП.Ссылка
		|ИЗ
		|	Документ.уп_ЗаявлениеЗЛОНазначенииНЧТП КАК уп_ЗаявлениеЗЛОНазначенииНЧТП
		|ГДЕ
		|	уп_ЗаявлениеЗЛОНазначенииНЧТП.Проведен
		|	И уп_ЗаявлениеЗЛОНазначенииНЧТП.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				ДоговорыОПС.ДоговорОПС
		|			ИЗ
		|				ДоговорыОПС КАК ДоговорыОПС)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.ДоговорОПС,
		|	уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Ссылка
		|ИЗ
		|	Документ.уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты КАК уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты
		|ГДЕ
		|	уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Проведен
		|	И уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				ДоговорыОПС.ДоговорОПС
		|			ИЗ
		|				ДоговорыОПС КАК ДоговорыОПС)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РешениеОбОтказеВЕдиновременнойВыплате.Ссылка КАК ОтказноеРешение,
		|	уп_РешениеОбОтказеВЕдиновременнойВыплате.ДокументОснование
		|ПОМЕСТИТЬ ОтказныеРешения
		|ИЗ
		|	Документ.уп_РешениеОбОтказеВЕдиновременнойВыплате КАК уп_РешениеОбОтказеВЕдиновременнойВыплате
		|ГДЕ
		|	уп_РешениеОбОтказеВЕдиновременнойВыплате.Проведен
		|	И уп_РешениеОбОтказеВЕдиновременнойВыплате.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				ДоговорыОПС.ДоговорОПС
		|			ИЗ
		|				ДоговорыОПС КАК ДоговорыОПС)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уп_РешениеОбОтказеНЧТП.Ссылка,
		|	уп_РешениеОбОтказеНЧТП.ДокументОснование
		|ИЗ
		|	Документ.уп_РешениеОбОтказеНЧТП КАК уп_РешениеОбОтказеНЧТП
		|ГДЕ
		|	уп_РешениеОбОтказеНЧТП.Проведен
		|	И уп_РешениеОбОтказеНЧТП.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				ДоговорыОПС.ДоговорОПС
		|			ИЗ
		|				ДоговорыОПС КАК ДоговорыОПС)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уп_РешениеОбОтказеСВ.Ссылка,
		|	уп_РешениеОбОтказеСВ.ДокументОснование
		|ИЗ
		|	Документ.уп_РешениеОбОтказеСВ КАК уп_РешениеОбОтказеСВ
		|ГДЕ
		|	уп_РешениеОбОтказеСВ.Проведен
		|	И уп_РешениеОбОтказеСВ.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				ДоговорыОПС.ДоговорОПС
		|			ИЗ
		|				ДоговорыОПС КАК ДоговорыОПС)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РешениеОЕдиновременнойВыплате.Ссылка КАК Решение,
		|	уп_РешениеОЕдиновременнойВыплате.ДокументОснование
		|ПОМЕСТИТЬ Решения
		|ИЗ
		|	Документ.уп_РешениеОЕдиновременнойВыплате КАК уп_РешениеОЕдиновременнойВыплате
		|ГДЕ
		|	уп_РешениеОЕдиновременнойВыплате.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				ДоговорыОПС.ДоговорОПС
		|			ИЗ
		|				ДоговорыОПС КАК ДоговорыОПС)
		|	И уп_РешениеОЕдиновременнойВыплате.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уп_РешениеОНазначенииНЧТП.Ссылка,
		|	уп_РешениеОНазначенииНЧТП.ДокументОснование
		|ИЗ
		|	Документ.уп_РешениеОНазначенииНЧТП КАК уп_РешениеОНазначенииНЧТП
		|ГДЕ
		|	уп_РешениеОНазначенииНЧТП.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				ДоговорыОПС.ДоговорОПС
		|			ИЗ
		|				ДоговорыОПС КАК ДоговорыОПС)
		|	И уп_РешениеОНазначенииНЧТП.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уп_РешениеОНазначенииСрочнойВыплаты.Ссылка,
		|	уп_РешениеОНазначенииСрочнойВыплаты.ДокументОснование
		|ИЗ
		|	Документ.уп_РешениеОНазначенииСрочнойВыплаты КАК уп_РешениеОНазначенииСрочнойВыплаты
		|ГДЕ
		|	уп_РешениеОНазначенииСрочнойВыплаты.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				ДоговорыОПС.ДоговорОПС
		|			ИЗ
		|				ДоговорыОПС КАК ДоговорыОПС)
		|	И уп_РешениеОНазначенииСрочнойВыплаты.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заявления.ДоговорОПС,
		|	Заявления.Заявление,
		|	Решения.Решение,
		|	ОтказныеРешения.ОтказноеРешение
		|ПОМЕСТИТЬ ЗаявленияСРешениями
		|ИЗ
		|	Заявления КАК Заявления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Решения КАК Решения
		|		ПО Заявления.Заявление = Решения.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОтказныеРешения КАК ОтказныеРешения
		|		ПО Заявления.Заявление = ОтказныеРешения.ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыОПС.ДоговорОПС,
		|	ДоговорыОПС.СНИЛС,
		|	ДоговорыОПС.Фамилия,
		|	ДоговорыОПС.Имя,
		|	ДоговорыОПС.Отчество,
		|	ДоговорыОПС.Нпп,
		|	ДоговорыОПС.НовыйСтраховщик,
		|	ДоговорыОПС.НовыйСтраховщикИНН,
		|	ДоговорыОПС.НовыйСтраховщикНаименование,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявленияСРешениями.Заявление) КАК Заявление,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявленияСРешениями.Решение) КАК Решение,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявленияСРешениями.ОтказноеРешение) КАК ОтказноеРешение,
		|	ДоговорыОПС.ТипПерехода
		|ПОМЕСТИТЬ ДоговорыСЗаявлениями
		|ИЗ
		|	ДоговорыОПС КАК ДоговорыОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаявленияСРешениями КАК ЗаявленияСРешениями
		|		ПО ДоговорыОПС.ДоговорОПС = ЗаявленияСРешениями.ДоговорОПС
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоговорыОПС.ДоговорОПС,
		|	ДоговорыОПС.СНИЛС,
		|	ДоговорыОПС.Фамилия,
		|	ДоговорыОПС.Имя,
		|	ДоговорыОПС.Отчество,
		|	ДоговорыОПС.Нпп,
		|	ДоговорыОПС.НовыйСтраховщик,
		|	ДоговорыОПС.НовыйСтраховщикИНН,
		|	ДоговорыОПС.НовыйСтраховщикНаименование,
		|	ДоговорыОПС.ТипПерехода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыСЗаявлениями.СНИЛС КАК СНИЛС,
		|	ДоговорыСЗаявлениями.Фамилия,
		|	ДоговорыСЗаявлениями.Имя,
		|	ДоговорыСЗаявлениями.Отчество,
		|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
		|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник КАК ЗЛ,
		|	уп_СостоянияДоговораОПССрезПоследних.Состояние,
		|	ДоговорыСЗаявлениями.Нпп КАК Нпп,
		|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Код КАК ДоговорНомер,
		|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.ДатаЗаключения КАК ДоговорДата,
		|	ДоговорыСЗаявлениями.НовыйСтраховщик,
		|	ДоговорыСЗаявлениями.НовыйСтраховщикИНН КАК НовыйСтраховщикИНН,
		|	ДоговорыСЗаявлениями.НовыйСтраховщикНаименование,
		|	ДоговорыСЗаявлениями.Заявление КАК КоличествоЗаявлений,
		|	ДоговорыСЗаявлениями.Решение КАК КоличествоРешений,
		|	ДоговорыСЗаявлениями.ОтказноеРешение КАК КоличествоОтказныхРешений,
		|	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия,
		|	ДоговорыСЗаявлениями.ТипПерехода,
		|	ВЫБОР
		|		КОГДА уп_СостоянияДоговораОПССрезПоследних.Состояние = &НакопительныйПериод
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВесСостояния
		|ИЗ
		|	ДоговорыСЗаявлениями КАК ДоговорыСЗаявлениями
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(
		|				&ДатаДок,
		|				ДоговорОПС.Организация = &Организация
		|					И ДоговорОПС В
		|						(ВЫБРАТЬ
		|							ДоговорыОПС.ДоговорОПС
		|						ИЗ
		|							ДоговорыОПС КАК ДоговорыОПС)) КАК уп_СостоянияДоговораОПССрезПоследних
		|		ПО ДоговорыСЗаявлениями.ДоговорОПС = уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(
		|				&ДатаДок,
		|				ДоговорОПС.Организация = &Организация
		|					И ДоговорОПС В
		|						(ВЫБРАТЬ
		|							ДоговорыОПС.ДоговорОПС
		|						ИЗ
		|							ДоговорыОПС КАК ДоговорыОПС)) КАК уп_ПричиныЗакрытияДоговоровОПССрезПоследних
		|		ПО ДоговорыСЗаявлениями.ДоговорОПС = уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ДоговорОПС
		|
		|УПОРЯДОЧИТЬ ПО
		|	Нпп,
		|	ДоговорДата УБЫВ
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДоговорОПС),
		|	СУММА(ВесСостояния)
		|ПО
		|	СНИЛС";
	КонецЕсли;
	//bardoshina-

	Запрос.УстановитьПараметр("ДатаДок", ДатаФормированияДокументов);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТабДляЗагрузки", ТабЗн);
	Запрос.УстановитьПараметр("НакопительныйПериод", Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод);


	ТабНайденныхДоговоров = Новый ТаблицаЗначений;
	ТабНайденныхДоговоров.Колонки.Добавить("ДоговорОПС", Новый ОписаниеТипов("СправочникСсылка.уп_ДоговорыОПС"));
	ТабНайденныхДоговоров.Колонки.Добавить("ПФ", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТабНайденныхДоговоров.Колонки.Добавить("Участник", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТабНайденныхДоговоров.Колонки.Добавить("Состояние", Новый ОписаниеТипов("ПеречислениеСсылка.уп_СостоянияДоговоровОПС"));
	ТабНайденныхДоговоров.Колонки.Добавить("ТипПерехода", Новый ОписаниеТипов("Число"));

	Результат = Запрос.Выполнить();


	ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Всего = Выборкаитоги.Количество();
	Нпп = 0;
	Пока ВыборкаИтоги.Следующий() Цикл
		Нпп = Нпп+1;
		#Если Клиент Тогда
			Состояние("Обработка строки "+Нпп+" из "+Всего);
		#КонецЕсли
		Если ВыборкаИтоги.ДоговорОПС = 0 Тогда
			Протокол.ДобавитьСтроку("Не найдены договоры об ОПС у ЗЛ страховой номер ПФР "+ВыборкаИтоги.СНИЛС);
		Иначе
			ВыборкаДетальныеЗаписи = ВыборкаИтоги.Выбрать();
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				//Если ВыборкаДетальныеЗаписи.ЗЛ = NULL Тогда //не найден контрагент
				//	Протокол.ДобавитьСтроку("Не найден ЗЛ "+ВыборкаДетальныеЗаписи.СНИЛС);
				Если ВыборкаДетальныеЗаписи.ДоговорОПС = NULL Тогда //не найден договор
					ФИО = ВыборкаДетальныеЗаписи.Фамилия+" "+ВыборкаДетальныеЗаписи.Имя+" "+ВыборкаДетальныеЗаписи.Отчество;
					Протокол.ДобавитьСтроку("Не найден договор об ОПС у ЗЛ "+ФИО+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС);
				Иначе //все в порядке
					Если ВыборкаИтоги.ВесСостояния>0 Тогда //там точно есть договор в накопительном периоде
						Если ВыборкаДетальныеЗаписи.Состояние <> Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод Тогда
							Для н=2 По ВыборкаДетальныеЗаписи.Количество() Цикл
								Если ВыборкаДетальныеЗаписи.Следующий() Тогда
									Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод Тогда
										Прервать;
									КонецЕсли;
								КонецЕсли;
								н=н+1;
							КонецЦикла;	
						КонецЕсли;	
					Иначе //ищем как обычно
						#Удаление 
						Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт Тогда
							//bardoshina+
							Для н=2 По ВыборкаДетальныеЗаписи.Количество() Цикл
								Если ВыборкаДетальныеЗаписи.Следующий() Тогда
									Если ВыборкаДетальныеЗаписи.Состояние <> Перечисления.уп_СостоянияДоговоровОПС.Закрыт Тогда
										Прервать;
									КонецЕсли;
								КонецЕсли;
								н=н+1;
							КонецЦикла;	
							Если ВыборкаДетальныеЗаписи.Количество()>1 И ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт Тогда
								ВыборкаДетальныеЗаписи.Сбросить();
								ВыборкаДетальныеЗаписи.Следующий();
							КонецЕсли;
						КонецЕсли;	
						#КонецУдаления
						#Вставка
						// +ХМНПФ 20.03.2017 ШадринАВ // РазобратьОбщуюТаблицу() // №865 // умершие должны попасть в ТЧ
						Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт
							ИЛИ ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию Тогда
							// -ХМНПФ 20.03.2017 ШадринАВ // РазобратьОбщуюТаблицу() // №865 // умершие должны попасть в ТЧ
						КонецЕсли;
						#КонецВставки
					КонецЕсли;
					//исключим тех, у кого есть заявление на ЕВ и нет отказного решения
					//вывод в отдельный протокол
					Если ИсключатьЗаявленияЕВНПСПВ Тогда
						Если ВыборкаДетальныеЗаписи.КоличествоЗаявлений > 0 Тогда
							Если ВыборкаДетальныеЗаписи.КоличествоРешений = 0 И ВыборкаДетальныеЗаписи.КоличествоОтказныхРешений > 0 Тогда
								//нет положительных решений, есть отказное, то не исключаем
							Иначе
								Если ПерваяЗаписьВПротоколеЗаявлений Тогда
									ПротоколЗаявления.ДобавитьСтроку(" ");
									ПротоколЗаявления.ДобавитьСтроку("Протокол загрузки "+ИмяФайла);
									ПротоколЗаявления.ДобавитьСтроку(" ");
									ПерваяЗаписьВПротоколеЗаявлений = Ложь;
								КонецЕсли;
								ПротоколЗаявления.ДобавитьСтроку("По договору №"+СокрЛП(ВыборкаДетальныеЗаписи.ДоговорОПС.Код)+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+" есть заявление (без отказного решения) и он не будет внесен в табличную часть!");
								Продолжить;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;	
					//исключим всех, кто не в накопительном периоде
					#Удаление 
					Если ВыборкаДетальныеЗаписи.Состояние <> Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод Тогда	
					#КонецУдаления
					#Вставка 
					// +ХМНПФ 20.03.2017 ШадринАВ // РазобратьОбщуюТаблицу() // №865
					Если ВыборкаДетальныеЗаписи.Состояние <> Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод
						И ВыборкаДетальныеЗаписи.Состояние <> Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПоступленияВзносов
						И ВыборкаДетальныеЗаписи.ПричинаЗакрытия <> Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
						// -ХМНПФ 20.03.2017 ШадринАВ // РазобратьОбщуюТаблицу() // №865							
					#КонецВставки
						Протокол.ДобавитьСтроку("Договор №"+СокрЛП(ВыборкаДетальныеЗаписи.ДоговорОПС.Код)+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+
						" имеет состояние " + ВыборкаДетальныеЗаписи.Состояние + " (причина закрытия - " + ВыборкаДетальныеЗаписи.ПричинаЗакрытия+") и не будет внесен в табличную часть!");
						Продолжить;
					КонецЕсли;	
					//bardoshina-
					//Если ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПодтвержденияПФР
					//	и ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостоянияДоговоровОПС.Заключен  Тогда
					//	Протокол.ДобавитьСтроку("Обратите внимание!! Состояние договора №"+ВыборкаДетальныеЗаписи.ДоговорОПС.Код+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+" = "+ВыборкаДетальныеЗаписи.Состояние);
					//	Продолжить;
					//КонецЕсли;	
					СтруктураОтбора = Новый Структура();

					СтруктураОтбора.Вставить("ДоговорОПС",     ВыборкаДетальныеЗаписи.ДоговорОПС);
					СтрокаТабличнойЧасти = ТабНайденныхДоговоров.НайтиСтроки(СтруктураОтбора);
					Если СтрокаТабличнойЧасти.Количество() <> 0 Тогда

					Иначе
						// Не нашли - добавляем новую строку.
						НовСтр = ТабНайденныхДоговоров.Добавить();
						НовСтр.ПФ = ВыборкаДетальныеЗаписи.НовыйСтраховщик;
						НовСтр.ДоговорОПС = ВыборкаДетальныеЗаписи.ДоговорОПС;
						НовСтр.Участник = ВыборкаДетальныеЗаписи.ДоговорОПС.Участник;
						НовСтр.Состояние = ВыборкаДетальныеЗаписи.Состояние;
						НовСтр.ТипПерехода = ВыборкаДетальныеЗаписи.ТипПерехода;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Протокол.ДобавитьСтроку("Не найдены договоры об ОПС у ЗЛ страховой номер ПФР "+ВыборкаИтоги.СНИЛС);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	РассчитатьДокументы(ТабНайденныхДоговоров, ИмяФайла);

КонецПроцедуры


&ИзменениеИКонтроль("РассчитатьДокументы")
Процедура ХМРассчитатьДокументы(ТабНайденныхДоговоров, ИмяФайла)
	СписокДокументов = Новый Массив;

	//расчет материнского капитала
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабНайденныхДоговоров.ДоговорОПС,
	|	ТабНайденныхДоговоров.Участник,
	|	ТабНайденныхДоговоров.ПФ,
	|	ТабНайденныхДоговоров.ТипПерехода,
	|	ТабНайденныхДоговоров.Состояние
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	&ТабНайденныхДоговоров КАК ТабНайденныхДоговоров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ТекущаяСуммаГарантированияОстатки.ДоговорОПС КАК ДоговорОПС,
	|	уп_ТекущаяСуммаГарантированияОстатки.СуммаОстаток КАК СуммаГарантированная,
	|	&Накопительный КАК ТипРезерва
	|ПОМЕСТИТЬ Гарантирование
	|ИЗ
	|	РегистрНакопления.уп_ТекущаяСуммаГарантирования.Остатки(
	|			&ДатаДок,
	|			Организация = &Организация
	|				И ДоговорОПС В (&СписокДоговоров)) КАК уп_ТекущаяСуммаГарантированияОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	#Удаление		
	|	уп_СостоянияДоговораОПССрезПервых.ДоговорОПС КАК ДоговорОПС,
	|	НАЧАЛОПЕРИОДА(уп_СостоянияДоговораОПССрезПервых.Период, ДЕНЬ) КАК ДатаВступленияВДействие
	|ПОМЕСТИТЬ ГодыВступленияВСилу
	|ИЗ
	|	РегистрСведений.уп_СостоянияДоговораОПС.СрезПервых(
	|			,
	|			ДоговорОПС В (&СписокДоговоров)
	|				И Состояние = &НакопительныйПериод) КАК уп_СостоянияДоговораОПССрезПервых
	#КонецУдаления 
	#Вставка		
	// +ХМНПФ 20.03.2017 ШадринАВ // РассчитатьДокументы() // №865
	|	СостоянияДоговораОПС.ДоговорОПС КАК ДоговорОПС,
	|	МИНИМУМ(НАЧАЛОПЕРИОДА(СостоянияДоговораОПС.Период, ДЕНЬ)) КАК ДатаВступленияВДействие
	|ПОМЕСТИТЬ ГодыВступленияВСилу
	|ИЗ
	|	РегистрСведений.уп_СостоянияДоговораОПС КАК СостоянияДоговораОПС
	|ГДЕ
	|	СостоянияДоговораОПС.ДоговорОПС В (&СписокДоговоров)
	|	И СостоянияДоговораОПС.Регистратор ССЫЛКА Документ.уп_РегистрацияПоступленийОПС
	|СГРУППИРОВАТЬ ПО
	|	СостоянияДоговораОПС.ДоговорОПС
	// -ХМНПФ 20.03.2017 ШадринАВ // РассчитатьДокументы() // №865
	#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыОПСОстатки.ДоговорОПС,
	|	СУММА(РезервыОПСОстатки.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ МатКапитал
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС.Остатки(
	|			&ДатаДок,
	|			ДоговорОПС В (&СписокДоговоров)
	|				И ТипСуммы В (&СписокТиповСумм)
	|				И ТипРезерва = &Накопительный) КАК РезервыОПСОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РезервыОПСОстатки.ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_НачисленияПенсийОПСОстатки.ДоговорОПС,
	|	СУММА(уп_НачисленияПенсийОПСОстатки.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ СрочныеПенсии
	|ИЗ
	|	РегистрНакопления.уп_НачисленияПенсийОПС.Остатки(
	|			&ДатаДок,
	|			ДоговорОПС В (&СписокДоговоров)
	|				И ТипПенсии = &СрочныхВыплат) КАК уп_НачисленияПенсийОПСОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_НачисленияПенсийОПСОстатки.ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_РезервыОПСОстатки.ДоговорОПС,
	|	СУММА(уп_РезервыОПСОстатки.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС.Остатки(
	|			&ДатаДок,
	|			Организация = &Организация
	|				И ДоговорОПС В (&СписокДоговоров)
	|				И ТипРезерва В (&СписокТиповРезерва)) КАК уп_РезервыОПСОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_РезервыОПСОстатки.ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СрочныеПенсии.СуммаОстаток, 0) КАК НачисленнаяСрочнаяПенсия,
	|	ЕСТЬNULL(МатКапитал.СуммаОстаток, 0) КАК МатКапитал,
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК Сумма,
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ИсходныеДанные.ДоговорОПС,
	|	ИсходныеДанные.Участник,
	|	ИсходныеДанные.ПФ КАК ПФ,
	|	ИсходныеДанные.Состояние,
	|	ЕСТЬNULL(Гарантирование.СуммаГарантированная, 0) КАК СуммаГарантированная,
	|	ГодыВступленияВСилу.ДатаВступленияВДействие,
	|	ИсходныеДанные.ТипПерехода КАК ТипПерехода
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ МатКапитал КАК МатКапитал
	|		ПО ИсходныеДанные.ДоговорОПС = МатКапитал.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ СрочныеПенсии КАК СрочныеПенсии
	|		ПО ИсходныеДанные.ДоговорОПС = СрочныеПенсии.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ИсходныеДанные.ДоговорОПС = Остатки.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Гарантирование КАК Гарантирование
	|		ПО ИсходныеДанные.ДоговорОПС = Гарантирование.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГодыВступленияВСилу КАК ГодыВступленияВСилу
	|		ПО ИсходныеДанные.ДоговорОПС = ГодыВступленияВСилу.ДоговорОПС
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ПФ,
	|	ТипПерехода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СрочныеПенсии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МатКапитал";


	Запрос.УстановитьПараметр("ДатаДок", ДатаФормированияДокументов-1);
	Запрос.УстановитьПараметр("Организация", Организация);

	СписокДоговоров = ТабНайденныхДоговоров.ВыгрузитьКолонку("ДоговорОПС");
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);

	СписокТиповСумм = Новый СписокЗначений;
	СписокТиповСумм.Добавить(Справочники.уп_ТипыСуммОПС.МатКапитал);
	СписокТиповСумм.Добавить(Справочники.уп_ТипыСуммОПС.ИДМатКапитал);
	Запрос.УстановитьПараметр("СписокТиповСумм", СписокТиповСумм);
	Запрос.УстановитьПараметр("Накопительный", Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	Запрос.УстановитьПараметр("СрочныхВыплат", Перечисления.уп_ТипыПенсийОПС.Срочная);
	Запрос.УстановитьПараметр("НакопительныйПериод", Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод);

	СписокТиповРезерва = Новый СписокЗначений;
	СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	//СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);
	Запрос.УстановитьПараметр("СписокТиповРезерва", СписокТиповРезерва);
	Запрос.УстановитьПараметр("ТабНайденныхДоговоров", ТабНайденныхДоговоров);


	Результат = Запрос.Выполнить();
	ВыборкаФондов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаФондов.Следующий() Цикл
		//создаем документ
		#Если Клиент Тогда
			Состояние("Создание документов по "+ВыборкаФондов.ПФ);
		#КонецЕсли
		ВыборкаТипов = ВыборкаФондов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТипов.Следующий() Цикл
			НовыйДокумент = Документы.уп_ЗакрытиеДоговораОПС.СоздатьДокумент();
			НовыйДокумент.Дата = ДатаФормированияДокументов;
			НовыйДокумент.Организация = Организация;
			НовыйДокумент.ДокументРегистрации = ДокументРегистрации;
			НовыйДокумент.Ответственный = Ответственный;
			НовыйДокумент.ОтражатьВБухгалтерскомУчете = ОтражатьВБухгалтерскомУчете;
			НовыйДокумент.ПенсионныйФонд = ВыборкаФондов.ПФ;
			Если ВыборкаТипов.ТипПерехода = 3 Тогда
				НовыйДокумент.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное;
				НовыйДокумент.Реорганизация = Истина;
				#Вставка 
				// +ХМНПФ 20.03.2017 ШадринАВ // РассчитатьДокументы() // №865
				#КонецВставки 
				#Удаление 
			ИначеЕсли ВыборкаТипов.ТипПерехода = 2 Тогда
				НовыйДокумент.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПереходДосрочный;
				#КонецУдаления
			Иначе
				НовыйДокумент.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное;
			КонецЕсли;
			НовыйДокумент.уп_ВидДеятельности = уп_ВидДеятельности;
			НовыйДокумент.ПодразделениеОрганизации = ПодразделениеОрганизации;
			НовыйДокумент.Комментарий = ИмяФайла;

			Выборка = ВыборкаТипов.Выбрать();

			Пока Выборка.Следующий() Цикл
				НовСтр = НовыйДокумент.ДоговорыОПС.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
				#Вставка 
				// +ХМНПФ 20.03.2017 ШадринАВ // РассчитатьДокументы() // №865
				#КонецВставки 
				#Удаление 
               	Если ДатаФормированияДокументов>='20160101' Тогда
					Если ВыборкаТипов.ТипПерехода = 2 Тогда
						//это досрочный переход
						//тогда минимум
						Если Выборка.Сумма<=Выборка.СуммаГарантированная Тогда
							НовСтр.Сумма = Выборка.Сумма;
						Иначе
							НовСтр.Сумма = Выборка.СуммаГарантированная;
						КонецЕсли;
					Иначе
						//тогда максимум
						Если Выборка.Сумма>=Выборка.СуммаГарантированная Тогда
							//стандартный вариант, выплачиваем остаток
							НовСтр.Сумма = Выборка.Сумма;
						Иначе
							НовСтр.Сумма = Выборка.СуммаГарантированная;
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
				#КонецУдаления
			КонецЦикла;
			НовыйДокумент.Записать();
			НовоеНачисление = НовыеНачисления.Добавить();
			НовоеНачисление.Документ = НовыйДокумент.Ссылка;
			СписокДокументов.Добавить(НовыйДокумент.Ссылка);
		КонецЦикла;
	КонецЦикла;

	//заполняем расшифровку

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.НомерСтроки,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС
	|ПОМЕСТИТЬ ДоговорыПоДокументам
	|ИЗ
	|	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК уп_ЗакрытиеДоговораОПСДоговорыОПС
	|ГДЕ
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка В(&СписокДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ТекущаяСуммаГарантированияОстатки.ДоговорОПС КАК ДоговорОПС,
	|	уп_ТекущаяСуммаГарантированияОстатки.ТипСуммы КАК ТипСуммы,
	|	уп_ТекущаяСуммаГарантированияОстатки.СуммаОстаток КАК СуммаГарантированная,
	|	&РПН КАК ТипРезерва
	|ПОМЕСТИТЬ Гарантирование
	|ИЗ
	|	РегистрНакопления.уп_ТекущаяСуммаГарантирования.Остатки(
	|			&ДатаДок,
	|			Организация = &Организация
	|				И ДоговорОПС В (&СписокДоговоров)) КАК уп_ТекущаяСуммаГарантированияОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС,
	|	ТипСуммы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(РезервыОПСОстатки.ДоговорОПС, Гарантирование.ДоговорОПС) КАК ДоговорОПС,
	|	ЕСТЬNULL(РезервыОПСОстатки.ТипСуммы, Гарантирование.ТипСуммы) КАК ТипСуммы,
	|	ЕСТЬNULL(РезервыОПСОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(РезервыОПСОстатки.ТипРезерва, Гарантирование.ТипРезерва) КАК ТипРезерва,
	|	ЕСТЬNULL(Гарантирование.СуммаГарантированная, 0) КАК СуммаГарантированная
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС.Остатки(
	|			&ДатаДок,
	|			ДоговорОПС В (&СписокДоговоров)
	|				И ТипРезерва В (&СписокТиповРезерва)) КАК РезервыОПСОстатки
	|		ПОЛНОЕ СОЕДИНЕНИЕ Гарантирование КАК Гарантирование
	|		ПО РезервыОПСОстатки.ДоговорОПС = Гарантирование.ДоговорОПС
	|			И РезервыОПСОстатки.ТипРезерва = Гарантирование.ТипРезерва
	|			И РезервыОПСОстатки.ТипСуммы = Гарантирование.ТипСуммы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС,
	|	ТипСуммы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_СуммыГарантийногоВосполненияОстатки.ДоговорОПС КАК ДоговорОПС,
	|	уп_СуммыГарантийногоВосполненияОстатки.ТипСуммы КАК ТипСуммы,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА уп_СуммыГарантийногоВосполненияОстатки.Вариант = ЗНАЧЕНИЕ(Перечисление.уп_ВариантВосполнения.Компенсация)
	|					ТОГДА уп_СуммыГарантийногоВосполненияОстатки.СуммаОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ, 0)) КАК СуммаКомпенсации,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА уп_СуммыГарантийногоВосполненияОстатки.Вариант = ЗНАЧЕНИЕ(Перечисление.уп_ВариантВосполнения.Восполнение)
	|					ТОГДА уп_СуммыГарантийногоВосполненияОстатки.СуммаОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ, 0)) КАК СуммаВосполнения,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА уп_СуммыГарантийногоВосполненияОстатки.Вариант = ЗНАЧЕНИЕ(Перечисление.уп_ВариантВосполнения.Возмещение)
	|					ТОГДА уп_СуммыГарантийногоВосполненияОстатки.СуммаОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ, 0)) КАК СуммаВозмещения
	|ПОМЕСТИТЬ Восполнение
	|ИЗ
	|	РегистрНакопления.уп_СуммыГарантийногоВосполнения.Остатки(
	|			&ДатаДок,
	|			Организация = &Организация
	|				И ДоговорОПС В (&СписокДоговоров)) КАК уп_СуммыГарантийногоВосполненияОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_СуммыГарантийногоВосполненияОстатки.ДоговорОПС,
	|	уп_СуммыГарантийногоВосполненияОстатки.ТипСуммы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС,
	|	ТипСуммы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	#Удаление		
	|	уп_СостоянияДоговораОПССрезПервых.ДоговорОПС КАК ДоговорОПС,
	|	НАЧАЛОПЕРИОДА(уп_СостоянияДоговораОПССрезПервых.Период, ДЕНЬ) КАК ДатаВступленияВДействие
	|ПОМЕСТИТЬ ГодыВступленияВСилу
	|ИЗ
	|	РегистрСведений.уп_СостоянияДоговораОПС.СрезПервых(
	|			,
	|			ДоговорОПС В (&СписокДоговоров)
	|				И Состояние = &НакопительныйПериод) КАК уп_СостоянияДоговораОПССрезПервых
	#КонецУдаления 
	#Вставка		
	// +ХМНПФ 20.03.2017 ШадринАВ // РассчитатьДокументы() // №865
	|	СостоянияДоговораОПС.ДоговорОПС КАК ДоговорОПС,
	|	МИНИМУМ(НАЧАЛОПЕРИОДА(СостоянияДоговораОПС.Период, ДЕНЬ)) КАК ДатаВступленияВДействие
	|ПОМЕСТИТЬ ГодыВступленияВСилу
	|ИЗ
	|	РегистрСведений.уп_СостоянияДоговораОПС КАК СостоянияДоговораОПС
	|ГДЕ
	|	СостоянияДоговораОПС.ДоговорОПС В (&СписокДоговоров)
	|	И СостоянияДоговораОПС.Регистратор ССЫЛКА Документ.уп_РегистрацияПоступленийОПС
	|СГРУППИРОВАТЬ ПО
	|	СостоянияДоговораОПС.ДоговорОПС
	// -ХМНПФ 20.03.2017 ШадринАВ // РассчитатьДокументы() // №865
	#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ДоговорОПС КАК ДоговорОПС,
	|	Остатки.ТипСуммы,
	|	Остатки.СуммаОстаток КАК СуммаОстаток,
	|	Остатки.ТипРезерва,
	|	Остатки.СуммаГарантированная КАК СуммаГарантированная,
	|	Восполнение.СуммаКомпенсации КАК СуммаКомпенсации,
	|	Восполнение.СуммаВосполнения КАК СуммаВосполнения,
	|	Восполнение.СуммаВозмещения КАК СуммаВозмещения,
	|	ГодыВступленияВСилу.ДатаВступленияВДействие КАК ДатаВступленияВДействие
	|ПОМЕСТИТЬ СведенияПоСуммамДоговорам
	|ИЗ
	|	Остатки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Восполнение КАК Восполнение
	|		ПО Остатки.ДоговорОПС = Восполнение.ДоговорОПС
	|			И Остатки.ТипСуммы = Восполнение.ТипСуммы
	|			И (Остатки.ТипРезерва = &РПН)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГодыВступленияВСилу КАК ГодыВступленияВСилу
	|		ПО Остатки.ДоговорОПС = ГодыВступленияВСилу.ДоговорОПС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СведенияПоСуммамДоговорам.СуммаОстаток,0) КАК Сумма,
	|	ЕСТЬNULL(СведенияПоСуммамДоговорам.СуммаОстаток,0) КАК СуммаОстаток,
	|	СведенияПоСуммамДоговорам.ТипСуммы,
	|	СведенияПоСуммамДоговорам.ТипРезерва,
	|	ДоговорыПоДокументам.Ссылка КАК Ссылка,
	|	ДоговорыПоДокументам.НомерСтроки КАК НомерСтроки,
	|	ДоговорыПоДокументам.ДоговорОПС КАК ДоговорОПС,
	|	ЕСТЬNULL(СведенияПоСуммамДоговорам.СуммаГарантированная,0) КАК СуммаГарантированная,
	|	ЕСТЬNULL(СведенияПоСуммамДоговорам.СуммаКомпенсации,0) КАК СуммаКомпенсации,
	|	ЕСТЬNULL(СведенияПоСуммамДоговорам.СуммаВосполнения,0) КАК СуммаВосполнения,
	|	ЕСТЬNULL(СведенияПоСуммамДоговорам.СуммаВозмещения,0) КАК СуммаВозмещения,
	|	СведенияПоСуммамДоговорам.ДатаВступленияВДействие
	|ИЗ
	|	ДоговорыПоДокументам КАК ДоговорыПоДокументам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СведенияПоСуммамДоговорам КАК СведенияПоСуммамДоговорам
	|		ПО ДоговорыПоДокументам.ДоговорОПС = СведенияПоСуммамДоговорам.ДоговорОПС
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаГарантированная)
	|ПО
	|	Ссылка,
	|	ДоговорОПС";

	Запрос.УстановитьПараметр("ДатаДок", ДатаФормированияДокументов-1);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("РПН", Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	Запрос.УстановитьПараметр("НакопительныйПериод", Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод);

	СписокТиповРезерва = Новый СписокЗначений;
	СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	//СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);

	//СписокДокументов = НовыеНачисления.ВыгрузитьКолонку("Документ");
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
	Запрос.УстановитьПараметр("СписокТиповРезерва", СписокТиповРезерва);

	Результат = Запрос.Выполнить();
	ВыборкаДокументов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВсегоДокументов = ВыборкаДокументов.Количество();
	НомДок = 0;
	Пока ВыборкаДокументов.Следующий() Цикл
		НомДок = НомДок+1;
		#Если Клиент Тогда
			Состояние("Расчет документ "+НомДок+ " из "+ВсегоДокументов);
		#КонецЕсли
		ДокОбъект = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
		//нужна для определения какую сумму к выплате ставить
		ВыборкаДоговоров = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаДоговоров.Следующий() Цикл
			ИспользуемСуммуГарантирования = Ложь;
			#Вставка 
			// +ХМНПФ 20.03.2017 ШадринАВ // РассчитатьДокументы() // №865
			#КонецВставки 
			#Удаление				
			Если ДатаФормированияДокументов>='20160101' Тогда
				Если ВыборкаДокументов.Ссылка.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное Тогда
				//Если ТипРасторжения = 0 Тогда
					//тогда максимум
					Если ВыборкаДоговоров.Сумма>=ВыборкаДоговоров.СуммаГарантированная Тогда
						//стандартный вариант, выплачиваем остаток
					Иначе
						ИспользуемСуммуГарантирования = Истина;
					КонецЕсли;
				Иначе //это досрочный переход
					//тогда минимум
					Если ВыборкаДоговоров.Сумма<=ВыборкаДоговоров.СуммаГарантированная Тогда
						//стандартный вариант, выплачиваем остаток
					Иначе
						ИспользуемСуммуГарантирования = Истина;
					КонецЕсли;
				КонецЕсли;
			Иначе
				ИспользуемСуммуГарантирования = Ложь;
			КонецЕсли;
			#КонецУдаления
			Выборка = ВыборкаДоговоров.Выбрать();

			Пока Выборка.Следующий() Цикл
				Если Выборка.Сумма<>0 Тогда
					НовСтрРасшифровки = ДокОбъект.РасшифровкаСуммы.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрРасшифровки,Выборка);
					Если ИспользуемСуммуГарантирования Тогда
						НовСтрРасшифровки.Сумма = Выборка.СуммаГарантированная;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		ДокОбъект.Записать();
	КонецЦикла;
	#Вставка		
	// +ХМНПФ 20.03.2017 ШадринАВ // РассчитатьДокументы() // №865
	ХМ_ОткорректироватьИД(СписокДокументов);
	// -ХМНПФ 20.03.2017 ШадринАВ // РассчитатьДокументы() // №865
	#КонецВставки
	
КонецПроцедуры
